#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.6`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.data_landing_zone.module.datalake_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.shared_app_exp_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.runtimes_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg][0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.shared_app_aut_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg][0m
[0m[1mmodule.data_landing_zone.azurerm_resource_group.storage_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.data.azurerm_client_config.current: Read complete after 1s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_landing_zone.azurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz02-dev-adf001][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp][0m
[0m[1mmodule.data_landing_zone.data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz02-rt001][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr][0m
[0m[1mmodule.data_landing_zone.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001][0m
[0m[1mmodule.data_landing_zone.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz02-nsg001][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur][0m
[0m[1mmodule.data_landing_zone.azapi_resource.storage_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/StorageSubnet][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.data.azuread_service_principal.databricks: Read complete after 0s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.data.azuread_service_principal.databricks: Read complete after 1s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/898a75b8-e17e-0ecc-85a0-3c26fdcca700][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/c6b9cc03-9304-fdfe-19d1-e3654565de1e][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/82e9d745-cf6b-861d-3b20-4196ffe4f52f][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/b6d318ea-1e24-e1d5-009f-0a4683293d0d][0m
[0m[1mmodule.data_landing_zone.azapi_resource.runtimes_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/RuntimesSubnet][0m
[0m[1mmodule.data_landing_zone.azapi_resource.powerbi_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/PowerBiSubnet][0m
[0m[1mmodule.data_landing_zone.azurerm_private_endpoint.data_factory_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-adf001-portal-pe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.shared_app_aut_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr/providers/Microsoft.Authorization/roleAssignments/55630714-e628-33bc-dfbf-881d680e9df3][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstenr/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur/providers/Microsoft.Authorization/roleAssignments/21640c96-36fc-50b6-0098-6b09eada7994][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstcur/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.shared_app_exp_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/a644ba6d-e9dc-eb72-7960-14b9cda261d1][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-queue-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-table-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstwsp-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-kv001-pe][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_private_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mmodule.data_landing_zone.module.datalake_enriched.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstenr.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-kv001-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_curated.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstcur.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_public_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw/managementPolicies/default][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstraw/providers/Microsoft.Authorization/roleAssignments/72e3fda4-1dc9-fba8-70c3-0ef5177bf02e][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz02devstraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_workspace.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstwsp.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_private_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz02-dev-aut-dbw001][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_web[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-web-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-aut-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.datalake_raw.azurerm_storage_container.datalake_containers["data"]: Refreshing state... [id=https://mydlz02devstraw.blob.core.windows.net/data][0m
[0m[1mmodule.data_landing_zone.azapi_resource.databricks_public_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz02-dev-exp-dbw001][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=30644216E4004DF0][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=5202479597450549|65114305-ebd5-447d-860d-6396356927b1][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=30644216E4004DEF][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz02-dev-exp-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=30644216E4004DED][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=30644216E4004DEE][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=1037510877603528|65114305-ebd5-447d-860d-6396356927b1][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.time_sleep.sleep_metastore_assignment: Refreshing state... [id=2023-05-30T16:08:34Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_mws_permission_assignment.permission_assignment[0]: Refreshing state... [id=5202479597450549|377231223141289][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.time_sleep.sleep_metastore_assignment: Refreshing state... [id=2023-05-30T16:06:44Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_mws_permission_assignment.permission_assignment[0]: Refreshing state... [id=1037510877603528|377231223141289][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.time_sleep.sleep_permission_assignment: Refreshing state... [id=2023-05-30T16:09:07Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.time_sleep.sleep_permission_assignment: Refreshing state... [id=2023-05-30T16:07:17Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_automation_configuration.databricks_secret_acl.secret_acl[0]: Refreshing state... [id=platform-secret-scope|||test][0m
[0m[1mmodule.data_landing_zone.module.databricks_experimentation_configuration.databricks_secret_acl.secret_acl[0]: Refreshing state... [id=platform-secret-scope|||test][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].time_rotating.rotation: Refreshing state... [id=2023-05-30T16:09:08Z][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_resource_group.data_product_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azapi_resource.subnets["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_storage_container.container_workspace[0]: Refreshing state... [id=https://mydlz02devstwsp.blob.core.windows.net/dptestprd][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azuread_application.application[0]: Refreshing state... [id=01bb14e2-dc48-4b95-882e-03a38f1413d0][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_storage_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/7bbfa96b-59c0-5452-9f4a-64486259cea6][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_user_assigned_identity.user_assigned_identity[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dptest-prd-uai001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/aed97699-ddb0-5430-5829-96bb42f603cd][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_databricks_access_connector.databricks_access_connector[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/aaac6cff-8960-f52b-ddef-69c4b8e0634d][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_subnets["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/f1adf2ce-b45a-a6d2-532b-403e181c303a][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azuread_service_principal.service_principal[0]: Refreshing state... [id=e6cf95b8-bb09-48ac-bc7c-4540cdd5359f][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/72d6c6b2-569f-c746-44ef-baf96b76ffd3][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/08ad6066-b2a1-344b-326b-263d1ea0ff8c][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnets["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/2d1e581d-8881-9a41-f459-fd3725241f55][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.dbac_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/62e4c6b6-a5cb-a9a5-6ee9-c76b865c2796][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].databricks_storage_credential.automation_storage_credential[0]: Refreshing state... [id=dptest-prd][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.dbac_roleassignment_storage_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/0a463029-ceeb-adfb-6c44-f62cac72af16][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azuread_service_principal_password.service_principal_password[0]: Refreshing state... [id=e6cf95b8-bb09-48ac-bc7c-4540cdd5359f/password/a1f18ac6-6033-44e6-a025-79e2eb8f87dd][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_subnets["DataProductSubnet-dptest-prd1"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/c0968043-1c3e-ecce-a5fc-4899e64eb8e1][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/e1dd6791-7997-c02c-34b9-cd007c11e4ad][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/0ab7c4b5-84aa-9230-2cf6-c4904ab9ddb9][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/2b51b40a-6de7-972a-3dca-8765fb15bf05][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/7c2d8e66-1363-f945-639b-f229e5ac0cb0][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/21864423-aad1-9a78-c784-2037d4c6b55e][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_private_endpoint.key_vault_private_endpoint[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/dptest-prd-vault001-pe][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/c4887a20-6a0f-952a-2e67-cd300f149ea8][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].time_sleep.sleep_dbac: Refreshing state... [id=2023-05-30T16:10:14Z][0m
[0m[1mmodule.data_landing_zone.module.data_products["dptest.yml"].time_sleep.sleep_key_vault: Refreshing state... [id=2023-05-30T16:12:19Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.azurerm_private_endpoint.data_factory_private_endpoint_data_factory[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "data_factory_private_endpoint_data_factory" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydlz02-dev-adf001-datafactory-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westeurope"
      [32m+[0m[0m name                          = "mydlz02-dev-adf001-datafactory-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydlz02-dev-runtimes-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/RuntimesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydlz02-dev-adf001-datafactory-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydlz02-dev-adf001-datafactory-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz02-dev-adf001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "dataFactory",
            ]
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azuread_client_config.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azuread_client_config" "current" {
      [32m+[0m[0m client_id = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m object_id = (known after apply)
      [32m+[0m[0m tenant_id = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azuread_group.security_group[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azuread_group" "security_group" {
      [32m+[0m[0m assignable_to_role             = (known after apply)
      [32m+[0m[0m auto_subscribe_new_members     = (known after apply)
      [32m+[0m[0m behaviors                      = (known after apply)
      [32m+[0m[0m description                    = (known after apply)
      [32m+[0m[0m display_name                   = "test"
      [32m+[0m[0m dynamic_membership             = (known after apply)
      [32m+[0m[0m external_senders_allowed       = (known after apply)
      [32m+[0m[0m hide_from_address_lists        = (known after apply)
      [32m+[0m[0m hide_from_outlook_clients      = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m mail                           = (known after apply)
      [32m+[0m[0m mail_enabled                   = (known after apply)
      [32m+[0m[0m mail_nickname                  = (known after apply)
      [32m+[0m[0m members                        = (known after apply)
      [32m+[0m[0m object_id                      = (known after apply)
      [32m+[0m[0m onpremises_domain_name         = (known after apply)
      [32m+[0m[0m onpremises_group_type          = (known after apply)
      [32m+[0m[0m onpremises_netbios_name        = (known after apply)
      [32m+[0m[0m onpremises_sam_account_name    = (known after apply)
      [32m+[0m[0m onpremises_security_identifier = (known after apply)
      [32m+[0m[0m onpremises_sync_enabled        = (known after apply)
      [32m+[0m[0m owners                         = (known after apply)
      [32m+[0m[0m preferred_language             = (known after apply)
      [32m+[0m[0m provisioning_options           = (known after apply)
      [32m+[0m[0m proxy_addresses                = (known after apply)
      [32m+[0m[0m security_enabled               = true
      [32m+[0m[0m theme                          = (known after apply)
      [32m+[0m[0m types                          = (known after apply)
      [32m+[0m[0m visibility                     = (known after apply)
      [32m+[0m[0m writeback_enabled              = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_client_config.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_client_config" "current" {
      [32m+[0m[0m client_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m object_id       = (known after apply)
      [32m+[0m[0m subscription_id = (known after apply)
      [32m+[0m[0m tenant_id       = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_network_security_group.network_security_group[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_network_security_group" "network_security_group" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = (known after apply)
      [32m+[0m[0m name                = "mycrp-prd-dlz02-nsg001"
      [32m+[0m[0m resource_group_name = "mycrp-prd-dlz02-network-rg"
      [32m+[0m[0m security_rule       = (known after apply)
      [32m+[0m[0m tags                = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_route_table.route_table[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_route_table" "route_table" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = (known after apply)
      [32m+[0m[0m name                = "mycrp-prd-dlz02-rt001"
      [32m+[0m[0m resource_group_name = "mycrp-prd-dlz02-network-rg"
      [32m+[0m[0m route               = (known after apply)
      [32m+[0m[0m subnets             = (known after apply)
      [32m+[0m[0m tags                = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_curated[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_storage_account" "datalake_curated" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = (known after apply)
      [32m+[0m[0m account_replication_type          = (known after apply)
      [32m+[0m[0m account_tier                      = (known after apply)
      [32m+[0m[0m allow_nested_items_to_be_public   = (known after apply)
      [32m+[0m[0m azure_files_authentication        = (known after apply)
      [32m+[0m[0m custom_domain                     = (known after apply)
      [32m+[0m[0m enable_https_traffic_only         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m identity                          = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = (known after apply)
      [32m+[0m[0m is_hns_enabled                    = (known after apply)
      [32m+[0m[0m location                          = (known after apply)
      [32m+[0m[0m name                              = "mydlz02devstcur"
      [32m+[0m[0m nfsv3_enabled                     = (known after apply)
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = (known after apply)
      [32m+[0m[0m resource_group_name               = "mydlz02-dev-storage-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m table_encryption_key_type         = (known after apply)
      [32m+[0m[0m tags                              = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_enriched[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_storage_account" "datalake_enriched" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = (known after apply)
      [32m+[0m[0m account_replication_type          = (known after apply)
      [32m+[0m[0m account_tier                      = (known after apply)
      [32m+[0m[0m allow_nested_items_to_be_public   = (known after apply)
      [32m+[0m[0m azure_files_authentication        = (known after apply)
      [32m+[0m[0m custom_domain                     = (known after apply)
      [32m+[0m[0m enable_https_traffic_only         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m identity                          = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = (known after apply)
      [32m+[0m[0m is_hns_enabled                    = (known after apply)
      [32m+[0m[0m location                          = (known after apply)
      [32m+[0m[0m name                              = "mydlz02devstenr"
      [32m+[0m[0m nfsv3_enabled                     = (known after apply)
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = (known after apply)
      [32m+[0m[0m resource_group_name               = "mydlz02-dev-storage-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m table_encryption_key_type         = (known after apply)
      [32m+[0m[0m tags                              = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_raw[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_storage_account" "datalake_raw" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = (known after apply)
      [32m+[0m[0m account_replication_type          = (known after apply)
      [32m+[0m[0m account_tier                      = (known after apply)
      [32m+[0m[0m allow_nested_items_to_be_public   = (known after apply)
      [32m+[0m[0m azure_files_authentication        = (known after apply)
      [32m+[0m[0m custom_domain                     = (known after apply)
      [32m+[0m[0m enable_https_traffic_only         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m identity                          = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = (known after apply)
      [32m+[0m[0m is_hns_enabled                    = (known after apply)
      [32m+[0m[0m location                          = (known after apply)
      [32m+[0m[0m name                              = "mydlz02devstraw"
      [32m+[0m[0m nfsv3_enabled                     = (known after apply)
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = (known after apply)
      [32m+[0m[0m resource_group_name               = "mydlz02-dev-storage-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m table_encryption_key_type         = (known after apply)
      [32m+[0m[0m tags                              = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_storage_account.datalake_workspace[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_storage_account" "datalake_workspace" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = (known after apply)
      [32m+[0m[0m account_replication_type          = (known after apply)
      [32m+[0m[0m account_tier                      = (known after apply)
      [32m+[0m[0m allow_nested_items_to_be_public   = (known after apply)
      [32m+[0m[0m azure_files_authentication        = (known after apply)
      [32m+[0m[0m custom_domain                     = (known after apply)
      [32m+[0m[0m enable_https_traffic_only         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m identity                          = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = (known after apply)
      [32m+[0m[0m is_hns_enabled                    = (known after apply)
      [32m+[0m[0m location                          = (known after apply)
      [32m+[0m[0m name                              = "mydlz02devstwsp"
      [32m+[0m[0m nfsv3_enabled                     = (known after apply)
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = (known after apply)
      [32m+[0m[0m resource_group_name               = "mydlz02-dev-storage-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m table_encryption_key_type         = (known after apply)
      [32m+[0m[0m tags                              = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].data.azurerm_virtual_network.virtual_network[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_virtual_network" "virtual_network" {
      [32m+[0m[0m address_space           = (known after apply)
      [32m+[0m[0m dns_servers             = (known after apply)
      [32m+[0m[0m guid                    = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m location                = (known after apply)
      [32m+[0m[0m name                    = "mycrp-prd-dlz02-vnet001"
      [32m+[0m[0m resource_group_name     = "mycrp-prd-dlz02-network-rg"
      [32m+[0m[0m subnets                 = (known after apply)
      [32m+[0m[0m tags                    = (known after apply)
      [32m+[0m[0m vnet_peerings           = (known after apply)
      [32m+[0m[0m vnet_peerings_addresses = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azapi_resource.subnets["DataProductSubnet-dptest-prd1"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "subnets" {
      [33m~[0m[0m body                      = jsonencode(
            {
              [31m-[0m[0m properties = {
                  [31m-[0m[0m addressPrefix                     = "10.0.48.96/28"
                  [31m-[0m[0m delegations                       = []
                  [31m-[0m[0m ipAllocations                     = []
                  [31m-[0m[0m networkSecurityGroup              = {
                      [31m-[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz02-nsg001"
                    }
                  [31m-[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [31m-[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [31m-[0m[0m routeTable                        = {
                      [31m-[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz02-rt001"
                    }
                  [31m-[0m[0m serviceEndpointPolicies           = []
                  [31m-[0m[0m serviceEndpoints                  = []
                }
            }
        ) -> (known after apply)
      [33m~[0m[0m id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1" -> (known after apply)
      [32m+[0m[0m location                  = (known after apply)
        name                      = "DataProductSubnet-dptest-prd1"
      [33m~[0m[0m output                    = jsonencode({}) -> (known after apply)
      [33m~[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m tags                      = {} -> (known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azuread_application.application[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azuread_application" "application" {
        id                             = "01bb14e2-dc48-4b95-882e-03a38f1413d0"
      [33m~[0m[0m owners                         = [
          [31m-[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ] -> (known after apply)
        tags                           = []
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (6 unchanged blocks hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azuread_service_principal.service_principal[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azuread_service_principal" "service_principal" {
        id                           = "e6cf95b8-bb09-48ac-bc7c-4540cdd5359f"
      [33m~[0m[0m owners                       = [
          [31m-[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ] -> (known after apply)
        tags                         = []
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001"
        name                            = "dptest-prd-vault001"
        tags                            = {
            "costCenter" = "ABCD1234"
        }
      [33m~[0m[0m tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" -> (known after apply)
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_security_group_display_name[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_security_group_display_name" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001"
      [32m+[0m[0m name                    = "securityGroupDisplayName"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_security_group_object_id[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_security_group_object_id" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001"
      [32m+[0m[0m name                    = "securityGroupObjectId"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_client_id[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_service_principal_client_id" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001"
      [32m+[0m[0m name                    = "servicePrincipalClientId"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_client_secret[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_service_principal_client_secret" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001"
      [32m+[0m[0m name                    = "servicePrincipalClientSecret"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_object_id[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_service_principal_object_id" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001"
      [32m+[0m[0m name                    = "servicePrincipalObjectId"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_key_vault_secret.key_vault_secret_service_principal_tenant_id[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_service_principal_tenant_id" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001"
      [32m+[0m[0m name                    = "servicePrincipalTenantId"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_private_endpoint.key_vault_private_endpoint[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/dptest-prd-vault001-pe" -> (known after apply)
        name                          = "dptest-prd-vault001-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Network/networkInterfaces/dptest-prd-vault001-nic"
              [31m-[0m[0m name = "dptest-prd-vault001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/dptest-prd-vault001-pe/privateDnsZoneGroups/dptest-prd-vault001-arecord/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              [31m-[0m[0m name                = "privatelink.vaultcore.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "dptest-prd-vault001.privatelink.vaultcore.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.48.100",
                        ]
                      [31m-[0m[0m name         = "dptest-prd-vault001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        tags                          = {
            "costCenter" = "ABCD1234"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/dptest-prd-vault001-pe/privateDnsZoneGroups/dptest-prd-vault001-arecord" -> (known after apply)
            name                 = "dptest-prd-vault001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                           = "dptest-prd-vault001-pe"
          [33m~[0m[0m private_ip_address             = "10.0.48.100" -> (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.current_roleassignment_key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/2b51b40a-6de7-972a-3dca-8765fb15bf05" -> (known after apply)
      [33m~[0m[0m name                             = "2b51b40a-6de7-972a-3dca-8765fb15bf05" -> (known after apply)
      [33m~[0m[0m principal_id                     = "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.dbac_roleassignment_storage_workspace[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "dbac_roleassignment_storage_workspace" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/0a463029-ceeb-adfb-6c44-f62cac72af16" -> (known after apply)
      [33m~[0m[0m name                             = "0a463029-ceeb-adfb-6c44-f62cac72af16" -> (known after apply)
      [33m~[0m[0m principal_type                   = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a" -> (known after apply)
      [33m~[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_container_workspace[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_container_workspace" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/blobServices/default/containers/dptestprd/providers/Microsoft.Authorization/roleAssignments/aaac6cff-8960-f52b-ddef-69c4b8e0634d" -> (known after apply)
      [33m~[0m[0m name                             = "aaac6cff-8960-f52b-ddef-69c4b8e0634d" -> (known after apply)
      [33m~[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "Group" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_key_vault" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.KeyVault/vaults/dptest-prd-vault001/providers/Microsoft.Authorization/roleAssignments/7c2d8e66-1363-f945-639b-f229e5ac0cb0" -> (known after apply)
      [33m~[0m[0m name                             = "7c2d8e66-1363-f945-639b-f229e5ac0cb0" -> (known after apply)
      [33m~[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "Group" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_resource_group[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_resource_group" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/aed97699-ddb0-5430-5829-96bb42f603cd" -> (known after apply)
      [33m~[0m[0m name                             = "aed97699-ddb0-5430-5829-96bb42f603cd" -> (known after apply)
      [33m~[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "Group" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_storage_workspace[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_storage_workspace" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp/providers/Microsoft.Authorization/roleAssignments/7bbfa96b-59c0-5452-9f4a-64486259cea6" -> (known after apply)
      [33m~[0m[0m name                             = "7bbfa96b-59c0-5452-9f4a-64486259cea6" -> (known after apply)
      [33m~[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "Group" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      [33m~[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz02devstwsp" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.security_group_roleassignment_subnets["DataProductSubnet-dptest-prd1"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "security_group_roleassignment_subnets" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/f1adf2ce-b45a-a6d2-532b-403e181c303a" -> (known after apply)
      [33m~[0m[0m name                             = "f1adf2ce-b45a-a6d2-532b-403e181c303a" -> (known after apply)
      [33m~[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "Group" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)
      [33m~[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.service_principal_roleassignment_subnets["DataProductSubnet-dptest-prd1"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "service_principal_roleassignment_subnets" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/c0968043-1c3e-ecce-a5fc-4899e64eb8e1" -> (known after apply)
      [33m~[0m[0m name                             = "c0968043-1c3e-ecce-a5fc-4899e64eb8e1" -> (known after apply)
      [33m~[0m[0m principal_type                   = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)
      [33m~[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnets["DataProductSubnet-dptest-prd1"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_subnets" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1/providers/Microsoft.Authorization/roleAssignments/2d1e581d-8881-9a41-f459-fd3725241f55" -> (known after apply)
      [33m~[0m[0m name                             = "2d1e581d-8881-9a41-f459-fd3725241f55" -> (known after apply)
      [33m~[0m[0m principal_type                   = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)
      [33m~[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/DataProductSubnet-dptest-prd1" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_catalog.automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "automation_catalog" {
      [32m+[0m[0m comment       = "Data Product Catalog - dptest-prd"
      [32m+[0m[0m force_destroy = false
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m metastore_id  = "65114305-ebd5-447d-860d-6396356927b1"
      [32m+[0m[0m name          = "dptest-prd"
      [32m+[0m[0m owner         = (known after apply)
      [32m+[0m[0m properties    = {
          [32m+[0m[0m "purpose" = "Data Product Catalog - dptest-prd"
        }
      [32m+[0m[0m storage_root  = "abfss://dptestprd@mydlz02devstwsp.dfs.core.windows.net"
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_external_location.automation_external_location[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "automation_external_location" {
      [32m+[0m[0m comment         = "Default Storage for dptest-prd Data Product"
      [32m+[0m[0m credential_name = "dptest-prd"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "dptest-prd"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://dptestprd@mydlz02devstwsp.dfs.core.windows.net"
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].databricks_grants.grants_automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grants" "grants_automation_catalog" {
      [32m+[0m[0m catalog = "dptest-prd"
      [32m+[0m[0m id      = (known after apply)

      [32m+[0m[0m grant {
          [32m+[0m[0m principal  = "test"
          [32m+[0m[0m privileges = [
              [32m+[0m[0m "ALL_PRIVILEGES",
            ]
        }
    }

[1m  # module.data_landing_zone.module.data_products["dptest.yml"].time_sleep.sleep_key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "time_sleep" "sleep_key_vault" {
      [33m~[0m[0m create_duration = "15s" [33m->[0m[0m "30s"
        id              = "2023-05-30T16:12:19Z"
    }

[1m  # module.data_landing_zone.module.databricks_automation.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m application_id          = ""
              [31m-[0m[0m certificate_permissions = []
              [31m-[0m[0m key_permissions         = []
              [31m-[0m[0m object_id               = "646e1bfe-cf17-4fdc-afd8-3992fda82399"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "Get",
                  [31m-[0m[0m "List",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            },
        ]
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-aut-kv001"
        name                            = "mydlz02-dev-aut-kv001"
        tags                            = {}
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.data.azurerm_client_config.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_client_config" "current" {
      [32m+[0m[0m client_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m object_id       = (known after apply)
      [32m+[0m[0m subscription_id = (known after apply)
      [32m+[0m[0m tenant_id       = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.data.databricks_group.group[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "databricks_group" "group" {
      [32m+[0m[0m child_groups       = (known after apply)
      [32m+[0m[0m display_name       = "test"
      [32m+[0m[0m external_id        = (known after apply)
      [32m+[0m[0m groups             = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m instance_profiles  = (known after apply)
      [32m+[0m[0m members            = (known after apply)
      [32m+[0m[0m service_principals = (known after apply)
      [32m+[0m[0m users              = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_automation_configuration.databricks_mws_permission_assignment.permission_assignment[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_mws_permission_assignment" "permission_assignment" {
      [33m~[0m[0m id           = "5202479597450549|377231223141289" -> (known after apply)
      [33m~[0m[0m principal_id = 377231223141289 [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_experimentation.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m application_id          = ""
              [31m-[0m[0m certificate_permissions = []
              [31m-[0m[0m key_permissions         = []
              [31m-[0m[0m object_id               = "646e1bfe-cf17-4fdc-afd8-3992fda82399"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "Get",
                  [31m-[0m[0m "List",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
            },
        ]
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz02-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz02-dev-exp-kv001"
        name                            = "mydlz02-dev-exp-kv001"
        tags                            = {}
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.databricks_experimentation_configuration.data.azurerm_client_config.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_client_config" "current" {
      [32m+[0m[0m client_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m object_id       = (known after apply)
      [32m+[0m[0m subscription_id = (known after apply)
      [32m+[0m[0m tenant_id       = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_experimentation_configuration.data.databricks_group.group[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "databricks_group" "group" {
      [32m+[0m[0m child_groups       = (known after apply)
      [32m+[0m[0m display_name       = "test"
      [32m+[0m[0m external_id        = (known after apply)
      [32m+[0m[0m groups             = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m instance_profiles  = (known after apply)
      [32m+[0m[0m members            = (known after apply)
      [32m+[0m[0m service_principals = (known after apply)
      [32m+[0m[0m users              = (known after apply)
    }

[1m  # module.data_landing_zone.module.databricks_experimentation_configuration.databricks_mws_permission_assignment.permission_assignment[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "databricks_mws_permission_assignment" "permission_assignment" {
      [33m~[0m[0m id           = "1037510877603528|377231223141289" -> (known after apply)
      [33m~[0m[0m principal_id = 377231223141289 [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_landing_zone.module.shir_001.data.azurerm_data_factory.data_factory[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_data_factory" "data_factory" {
      [32m+[0m[0m github_configuration = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m identity             = (known after apply)
      [32m+[0m[0m location             = (known after apply)
      [32m+[0m[0m name                 = "mydlz02-dev-adf001"
      [32m+[0m[0m resource_group_name  = "mydlz02-dev-runtimes-rg"
      [32m+[0m[0m tags                 = (known after apply)
      [32m+[0m[0m vsts_configuration   = (known after apply)
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir[0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory_integration_runtime_self_hosted" "data_factory_shir" {
      [32m+[0m[0m data_factory_id             = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "mydlz02-dev-shir001"
      [32m+[0m[0m primary_authorization_key   = (known after apply)
      [32m+[0m[0m secondary_authorization_key = (known after apply)
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb.lb[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb" "lb" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m location             = "westeurope"
      [32m+[0m[0m name                 = "mydlz02-dev-shir001-lb"
      [32m+[0m[0m private_ip_address   = (known after apply)
      [32m+[0m[0m private_ip_addresses = (known after apply)
      [32m+[0m[0m resource_group_name  = "mydlz02-dev-runtimes-rg"
      [32m+[0m[0m sku                  = "Standard"
      [32m+[0m[0m sku_tier             = "Regional"

      [32m+[0m[0m frontend_ip_configuration {
          [32m+[0m[0m gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          [32m+[0m[0m id                                                 = (known after apply)
          [32m+[0m[0m inbound_nat_rules                                  = (known after apply)
          [32m+[0m[0m load_balancer_rules                                = (known after apply)
          [32m+[0m[0m name                                               = "frontendipconfiguration"
          [32m+[0m[0m outbound_rules                                     = (known after apply)
          [32m+[0m[0m private_ip_address                                 = (known after apply)
          [32m+[0m[0m private_ip_address_allocation                      = "Dynamic"
          [32m+[0m[0m private_ip_address_version                         = "IPv4"
          [32m+[0m[0m public_ip_address_id                               = (known after apply)
          [32m+[0m[0m public_ip_prefix_id                                = (known after apply)
          [32m+[0m[0m subnet_id                                          = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/RuntimesSubnet"
          [32m+[0m[0m zones                                              = [
              [32m+[0m[0m "1",
              [32m+[0m[0m "2",
              [32m+[0m[0m "3",
            ]
        }
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb_backend_address_pool" "lb_backend_address_pool" {
      [32m+[0m[0m backend_ip_configurations = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m inbound_nat_rules         = (known after apply)
      [32m+[0m[0m load_balancing_rules      = (known after apply)
      [32m+[0m[0m loadbalancer_id           = (known after apply)
      [32m+[0m[0m name                      = "mydlz02-dev-shir001-backendaddresspool"
      [32m+[0m[0m outbound_rules            = (known after apply)
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_nat_pool.lb_nat_pool[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb_nat_pool" "lb_nat_pool" {
      [32m+[0m[0m backend_port                   = 3389
      [32m+[0m[0m floating_ip_enabled            = false
      [32m+[0m[0m frontend_ip_configuration_id   = (known after apply)
      [32m+[0m[0m frontend_ip_configuration_name = "frontendipconfiguration"
      [32m+[0m[0m frontend_port_end              = 50099
      [32m+[0m[0m frontend_port_start            = 50000
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m idle_timeout_in_minutes        = 4
      [32m+[0m[0m loadbalancer_id                = (known after apply)
      [32m+[0m[0m name                           = "mydlz02-dev-shir001-natpool"
      [32m+[0m[0m protocol                       = "Tcp"
      [32m+[0m[0m resource_group_name            = "mydlz02-dev-runtimes-rg"
      [32m+[0m[0m tcp_reset_enabled              = true
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_probe.lb_probe[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb_probe" "lb_probe" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m interval_in_seconds = 5
      [32m+[0m[0m load_balancer_rules = (known after apply)
      [32m+[0m[0m loadbalancer_id     = (known after apply)
      [32m+[0m[0m name                = "mydlz02-dev-shir001-probe"
      [32m+[0m[0m number_of_probes    = 2
      [32m+[0m[0m port                = 80
      [32m+[0m[0m probe_threshold     = 1
      [32m+[0m[0m protocol            = "Http"
      [32m+[0m[0m request_path        = "/"
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_lb_rule.lb_rule[0m will be created
[0m  [32m+[0m[0m resource "azurerm_lb_rule" "lb_rule" {
      [32m+[0m[0m backend_address_pool_ids       = (known after apply)
      [32m+[0m[0m backend_port                   = 80
      [32m+[0m[0m disable_outbound_snat          = false
      [32m+[0m[0m enable_floating_ip             = false
      [32m+[0m[0m enable_tcp_reset               = true
      [32m+[0m[0m frontend_ip_configuration_id   = (known after apply)
      [32m+[0m[0m frontend_ip_configuration_name = "frontendipconfiguration"
      [32m+[0m[0m frontend_port                  = 80
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m idle_timeout_in_minutes        = 4
      [32m+[0m[0m load_distribution              = "Default"
      [32m+[0m[0m loadbalancer_id                = (known after apply)
      [32m+[0m[0m name                           = "mydlz02-dev-shir001-rule"
      [32m+[0m[0m probe_id                       = (known after apply)
      [32m+[0m[0m protocol                       = "Tcp"
    }

[1m  # module.data_landing_zone.module.shir_001.azurerm_windows_virtual_machine_scale_set.vmss[0m will be created
[0m  [32m+[0m[0m resource "azurerm_windows_virtual_machine_scale_set" "vmss" {
      [32m+[0m[0m admin_password                                    = (sensitive value)
      [32m+[0m[0m admin_username                                    = (sensitive value)
      [32m+[0m[0m computer_name_prefix                              = "mydlz02-d"
      [32m+[0m[0m custom_data                                       = (sensitive value)
      [32m+[0m[0m do_not_run_extensions_on_overprovisioned_machines = false
      [32m+[0m[0m enable_automatic_updates                          = true
      [32m+[0m[0m encryption_at_host_enabled                        = true
      [32m+[0m[0m extension_operations_enabled                      = true
      [32m+[0m[0m extensions_time_budget                            = "PT1H30M"
      [32m+[0m[0m id                                                = (known after apply)
      [32m+[0m[0m instances                                         = 1
      [32m+[0m[0m location                                          = "westeurope"
      [32m+[0m[0m max_bid_price                                     = -1
      [32m+[0m[0m name                                              = "mydlz02-dev-shir001"
      [32m+[0m[0m overprovision                                     = false
      [32m+[0m[0m platform_fault_domain_count                       = (known after apply)
      [32m+[0m[0m priority                                          = "Regular"
      [32m+[0m[0m provision_vm_agent                                = true
      [32m+[0m[0m resource_group_name                               = "mydlz02-dev-runtimes-rg"
      [32m+[0m[0m scale_in_policy                                   = (known after apply)
      [32m+[0m[0m secure_boot_enabled                               = true
      [32m+[0m[0m single_placement_group                            = true
      [32m+[0m[0m sku                                               = "Standard_D4ads_v5"
      [32m+[0m[0m timezone                                          = "UTC"
      [32m+[0m[0m unique_id                                         = (known after apply)
      [32m+[0m[0m upgrade_mode                                      = "Automatic"
      [32m+[0m[0m vtpm_enabled                                      = true
      [32m+[0m[0m zone_balance                                      = false
      [32m+[0m[0m zones                                             = [
          [32m+[0m[0m "1",
          [32m+[0m[0m "2",
          [32m+[0m[0m "3",
        ]

      [32m+[0m[0m automatic_os_upgrade_policy {
          [32m+[0m[0m disable_automatic_rollback  = false
          [32m+[0m[0m enable_automatic_os_upgrade = false
        }

      [32m+[0m[0m extension {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_interface {
          [32m+[0m[0m enable_accelerated_networking = false
          [32m+[0m[0m enable_ip_forwarding          = false
          [32m+[0m[0m name                          = "mydlz02-dev-shir001-nic"
          [32m+[0m[0m primary                       = true

          [32m+[0m[0m ip_configuration {
              [32m+[0m[0m load_balancer_backend_address_pool_ids = (known after apply)
              [32m+[0m[0m load_balancer_inbound_nat_rules_ids    = (known after apply)
              [32m+[0m[0m name                                   = "mydlz02-dev-shir001-ipconfig"
              [32m+[0m[0m primary                                = true
              [32m+[0m[0m subnet_id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz02-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz02-vnet001/subnets/RuntimesSubnet"
              [32m+[0m[0m version                                = "IPv4"
            }
        }

      [32m+[0m[0m os_disk {
          [32m+[0m[0m caching                   = "ReadWrite"
          [32m+[0m[0m disk_size_gb              = (known after apply)
          [32m+[0m[0m storage_account_type      = "Premium_ZRS"
          [32m+[0m[0m write_accelerator_enabled = false
        }

      [32m+[0m[0m source_image_reference {
          [32m+[0m[0m offer     = "WindowsServer"
          [32m+[0m[0m publisher = "MicrosoftWindowsServer"
          [32m+[0m[0m sku       = "2022-datacenter-azure-edition"
          [32m+[0m[0m version   = "latest"
        }
    }

[1m  # module.data_landing_zone.module.shir_001.random_password.password[0m will be created
[0m  [32m+[0m[0m resource "random_password" "password" {
      [32m+[0m[0m bcrypt_hash      = (sensitive value)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m length           = 16
      [32m+[0m[0m lower            = true
      [32m+[0m[0m min_lower        = 0
      [32m+[0m[0m min_numeric      = 0
      [32m+[0m[0m min_special      = 0
      [32m+[0m[0m min_upper        = 0
      [32m+[0m[0m number           = true
      [32m+[0m[0m numeric          = true
      [32m+[0m[0m override_special = "!#$%&*()-_=+[]{}<>:?"
      [32m+[0m[0m result           = (sensitive value)
      [32m+[0m[0m special          = true
      [32m+[0m[0m upper            = true
    }

[1mPlan:[0m 31 to add, 6 to change, 13 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "databricks_account_id"
[33m│[0m [0mbut a value was found in file "vars.dev.tfvars". If you meant to use this
[33m│[0m [0mvalue, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>